package day19;

public class Ex01 {
/*람다식
 * 자바 8부터 함수적 프로그래밍 위해 람다식 지원
 * 람다식을 언어차원에서제공
 * 람다계산법에서 사요된 식을프로그래밍 언어에 접목
 * 익명함수를 생성하기 위한 식
 * 
 * 자바에서 람다식을 수요한 이유
 * 코드가 매우 간결해진다. 
 * 컬렉션 요소를 필터링또는 매핑해 쉽게 집계
 * 
 * 자바는 람다식을 함수적 인터페이스의 익명 구현객체로 취급
 * 람다식 -> 매개변수를 가진 코드 블록 -> 익명 구현 객체
 * 어떤 인터페이스를 구현할지는 대입되는 인터페이스에 달려있음
 * 
 * Runnable runnable = () ->{...};
 * 
 * 함수적 스타일의 람다식 작성법
 * 매개타입은 런타임시 대입값 따라 자동인식 -> 생략가능
 * 하나의 매개변수만 있을경우 괄호() 생략가능
 * 하나의 실행문만 있다면 중괄호{} 생략가능
 * 매개변수 없다면 괄호() 생략불가
 * 리턴값있으면 리턴문사용
 * 중괄호에 리턴문만있을시 중괄호생략가능
 * 
 * 타겟타입
 * 람다식이 대입되는 인터페이스
 * 익명구현객체를 만들대 사용할 인터페이스 
 * 인터페이스 변수 = 람다식 ; 
 * 
 * 함수적 인터페이스 
 * 하나의 추상 메소드만 선언도니인터페이스가 타겟 타입
 * @FUnctionallterface어노테이션
 * -하나의 추상메소드만가지는지 컴파일러가 체크
 * -두개 이상의 추상메소드가 선언되어 있으면 컴파일 오류발생
 * */
}
